Функция МассвоеСоздание(Параметр) Экспорт
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
    |	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора <= &Дата
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора >= &Дата
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Документ,
	|	ВТ_Договоры.Ссылка КАК Договор
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Договоры.Ссылка = РеализацияТоваровУслуг.Договор";
	
	Запрос.УстановитьПараметр("Дата", Параметр.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Документ.Пустая() Тогда
			
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокументРеализации(Выборка.Договор,Параметр);
			НовыйДокумент.ВыполнитьАвтозаполнение();
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);  
			
			
			ДобавитьСтруктуру = Новый Структура;
			ДобавитьСтруктуру.Вставить("Документ",НовыйДокумент.Ссылка);
			ДобавитьСтруктуру.Вставить("Договор",Выборка.Договор);
			Массив.Добавить(ДобавитьСтруктуру);

			
		Иначе 
				
			Документ = Выборка.Документ.ПолучитьОбъект();
			Документ.ВыполнитьАвтозаполнение();
			Документ.Записать(РежимЗаписиДокумента.Проведение); 
			
			//Надо ли передавать эти данные в таьличную часть Обработки???
			ДобавитьСтруктуру = Новый Структура;
			ДобавитьСтруктуру.Вставить("Документ",Выборка.Документ);
			ДобавитьСтруктуру.Вставить("Договор",Выборка.Договор);
			Массив.Добавить(ДобавитьСтруктуру);


		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Массив;
				
КонецФункции 

//Функция СоздатьДокумент(Договор,Параметр) 
//	
//	Ревизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,"Владелец, Организация");  
//	
//	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
//	НовыйДокумент.Дата = Параметр.Дата;
//	НовыйДокумент.Контрагент = Ревизиты.Владелец;
//	НовыйДокумент.Организация = Ревизиты.Организация;
//	НовыйДокумент.Договор = Договор; 
//	НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
//	НовыйДокумент.Записать();
//	Возврат НовыйДокумент;
//	
//КонецФункции
