#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс
	
	Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
		
		Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
			
			КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
			КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
			КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
			КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
			
			Возврат КомандаСоздатьНаОсновании;
			
		КонецЕсли;
		
		Возврат Неопределено;
		
		
		
	КонецФункции 
	
	Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
		НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
	КонецПроцедуры
	
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		// Акт об оказании услуг
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "УправлениеПечатью";
		КомандаПечати.Идентификатор = "Документ.РеализацияТоваровУслуг.ПФ_DOC_АктОбОказанииУслуг";
		КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг'");
		КомандаПечати.Порядок = 5;
		
	КонецПроцедуры
		
	#КонецОбласти   
	
	#Область СлужебныеПроцедурыИФункции
	Функция СоздатьДокументРеализации(Договор,Параметр)Экспорт  
		
		Ревизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,"Владелец, Организация");  
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата = Параметр.Дата;
		НовыйДокумент.Контрагент = Ревизиты.Владелец;
		НовыйДокумент.Организация = Ревизиты.Организация;
		НовыйДокумент.Договор = Договор; 
		НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
		НовыйДокумент.Записать();
		Возврат НовыйДокумент;
		
	КонецФункции 
	
	#КонецОбласти   
#КонецЕсли  






